:PROPERTIES:
:ID:       de8fd72d-10b5-45e4-b2a0-541291da66f9
:END:
#+TITLE: Mean field approximations
#+FILETAGS: :concept: :slides: :presentation:
#+SETUPFILE: ~/.config/emacs/setup/setupfile.org
#+STARTUP: beamer indent hidestars
#+LANGUAGE:  en
#+OPTIONS:   H:2 num:t toc:f \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LaTeX_CLASS_OPTIONS: [8pt]
#+LaTeX_CLASS: beamer
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{multimedia}
#+LATEX_HEADER: \newcommand\mitdbar{\text{\ulcshape\slshape đ}}
#+OPTIONS: H:2
** Example: Ising model :noexport:

#+begin_src python :results output
  import numpy as np

  def fixed_point_iteration(J, h, beta, m_init, max_iter=1000, tol=1e-6, print_info=False):
      N = len(m_init)  # Number of nodes
      m = np.copy(m_init)  # Initialize magnetization vector
      m_prev = np.zeros(N)  # Store the previous magnetization vector for convergence check

      for t in range(max_iter):
          for i in range(N):
              m_prev[i] = m[i]  # Store the previous value of magnetization for the i-th node
              m_sum = np.dot(J[i], m)  # Calculate the sum of interaction between nodes
              m[i] = np.tanh(beta / 2 * (m_sum + h[i]))  # Update the magnetization for the i-th node

          if np.linalg.norm(m - m_prev) < tol:  # Check for convergence
              if print_info:
                  print(f"Converged in {t+1} iterations.")
              break
      else:
          if print_info:
              print(f"Reached maximum iterations ({max_iter}) without convergence.")

      return m

  def gaussian_J_matrix(N, J0, J, seed=None):
      np.random.seed(seed)  # Set the seed for reproducibility (optional)
      J_matrix = np.random.normal(J0 / N, np.sqrt(J ** 2 / N), (N, N))
      np.fill_diagonal(J_matrix, 0)  # Set diagonal elements to 0
      return J_matrix

  def tap_magnetization_iteration(beta, J, h, m_init, max_iter=1000, tol=1e-6, print_info=False):
      N = len(m_init)
      m = np.copy(m_init)
      m_prev = np.zeros(N)

      def tap_magnetization_iterator(beta, J, m, h):
          N = len(m)
          m_new = np.copy(m)

          for i in range(N):
              m_sum = np.dot(J[i], m) - beta * J[i, i] * (1 - m[i] ** 2) * m[i]
              m_new[i] = np.tanh(beta * (m_sum + h[i]))

          return m_new

      for t in range(max_iter):
          m_prev = np.copy(m)
          m = tap_magnetization_iterator(beta, J, m, h)

          if np.linalg.norm(m - m_prev) < tol:  # Check for convergence
              if print_info:
                  print(f"Converged in {t+1} iterations.")
                  break
              else:
                  if print_info:
                      print(f"Reached maximum iterations ({max_iter}) without convergence.")

      return m

  N = 100

  # Constant J matrix with diagonals set to 0
  J_const = np.full((N, N), 0.5)
  np.fill_diagonal(J_const, 0)

  # Example usage
  J0 = 0.5
  J = 1.5
  J_SK = gaussian_J_matrix(N, J0, J)
  J_simple = np.random.rand(N, N)

  m_init = np.random.uniform(-1, 1, N)  # Initialize m with a uniform distribution from -1 to 1
  h = np.random.rand(N)  # Initialize h with random values, one for each node

  h = np.random.rand(N)
  beta = 0.1

  # Run fixed point iteration for both cases with print_info enabled
  # magnetizations_const_J = fixed_point_iteration(J_const, h, beta, m_init, print_info=True)
  # print("Magnetizations (constant J):\n", magnetizations_const_J)

  # magnetizations_rand_J = fixed_point_iteration(J_SK, h, beta, m_init, print_info=True)
  # print("Magnetizations (random J, Naive):\n", magnetizations_rand_J)

  m_tap = tap_magnetization_iteration(beta, J_simple, h, m_init, max_iter=1000, print_info=True)
  print("Magnetizations (random J, TAP):\n", m_tap)
#+end_src

#+RESULTS:
#+begin_example
Converged in 6 iterations.
Magnetizations (random J, TAP):
 [0.99992876 0.99992013 0.99988833 0.99990526 0.99990845 0.99996131
 0.99994952 0.99990752 0.9999169  0.99985028 0.99988406 0.99994908
 0.99992382 0.99988873 0.99995804 0.99991044 0.99996738 0.99986763
 0.99985417 0.99996577 0.99996182 0.99990156 0.99987851 0.99991306
 0.99988129 0.99997527 0.99995247 0.99984912 0.99990562 0.99988166
 0.99988699 0.99994865 0.99985414 0.9998982  0.99974031 0.99985662
 0.99995399 0.99993373 0.99992384 0.9999114  0.99991434 0.99988681
 0.99991506 0.99995311 0.99990891 0.99991029 0.99992441 0.99984208
 0.99972183 0.99979348 0.99985327 0.99993739 0.99990961 0.99991187
 0.99992078 0.99994797 0.99979677 0.99989445 0.99997007 0.99992553
 0.99987474 0.99994393 0.99980212 0.99986756 0.99995904 0.99995176
 0.99988242 0.99990946 0.99991776 0.99994476 0.9998991  0.99994921
 0.99996289 0.99983213 0.99995966 0.99988899 0.99991466 0.99991601
 0.99993333 0.99983672 0.99984034 0.99981382 0.999905   0.99996953
 0.99987883 0.999942   0.99975783 0.99990887 0.99988325 0.99992929
 0.99991562 0.99993759 0.9997579  0.99989662 0.99975422 0.99994739
 0.99993356 0.99993991 0.99990931 0.999591  ]
#+end_example

#+begin_src python :results output
  import numpy as np
  from scipy.integrate import quad
  from scipy.stats import norm

  def tap_magnetization_iteration_improved(beta, J, h, max_iter=1000, tol=1e-6, print_info=False):
      N = len(h)

      # Calculate q using the fixed point equation
      def integrand(z, beta, q, h):
          return (np.tanh(h + beta * np.sqrt(q) * z) ** 2) * norm.pdf(z)

      def find_fixed_point_q(beta, h, tol=1e-6, max_iter=100):
          q = 0.5
          for _ in range(max_iter):
              q_new = np.mean([quad(integrand, -np.inf, np.inf, args=(beta, q, h_i))[0] for h_i in h])
              if np.abs(q_new - q) < tol:
                  break
              q = q_new
          return q

      q_init = find_fixed_point_q(beta, h)

      # Initialize the magnetization state
      m = np.zeros((2, N))
      m[0, :] = np.sqrt(q_init)

      def tap_magnetization_iterator_improved(beta, J, m, h):
          N = len(m[0])
          m_new = np.zeros(N)
          q = np.mean(m[0] ** 2)

          for i in range(N):
              m_sum = np.dot(J[i] / np.sqrt(N), m[0]) - beta**2 * (1 - q) * m[1, i]
              m_new[i] = np.tanh(beta * (m_sum + h[i]))

          return m_new

      for t in range(max_iter):
          m[1, :] = m[0, :]
          m[0, :] = tap_magnetization_iterator_improved(beta, J, m, h)

          if np.linalg.norm(m[0] - m[1]) < tol:  # Check for convergence
              if print_info:
                  print(f"Converged in {t+1} iterations.")
              break
      else:
          if print_info:
              print(f"Reached maximum iterations ({max_iter}) without convergence.")

      return m[0]

  # Define the input parameters
  N = 100
  beta = 0.1
  J = np.random.rand(N, N)
  h = np.random.rand(N)

  # Call the function with the input parameters
  m_final = tap_magnetization_iteration_improved(beta, J, h, max_iter=1000, tol=1e-6, print_info=True)

  # Print the final magnetization values
  print("Final magnetization values:")
  print(m_final)
#+end_src

#+RESULTS:
#+begin_example
Converged in 22 iterations.
Final magnetization values:
[0.14812438 0.1110618  0.10622239 0.07469878 0.09397081 0.1242689
 0.12198917 0.10124817 0.08879623 0.04781248 0.07666495 0.07090919
 0.096462   0.09975953 0.06417435 0.1410214  0.06692183 0.05005716
 0.11165473 0.09120775 0.1228168  0.13756595 0.07231846 0.08635823
 0.06369731 0.10908854 0.11475501 0.05213947 0.06238809 0.07692839
 0.05705433 0.06366623 0.07351446 0.13585109 0.12941209 0.13910195
 0.10489842 0.06650329 0.07859141 0.12569555 0.05778047 0.08732212
 0.14332531 0.14784197 0.13786597 0.10752695 0.04784714 0.0899344
 0.05327329 0.08456194 0.07062776 0.12744718 0.07917801 0.0881339
 0.11281682 0.1060175  0.06588288 0.07374079 0.10814351 0.10011108
 0.1346027  0.08296234 0.12136828 0.11868041 0.09885679 0.10986971
 0.06675263 0.0703632  0.08085024 0.14291374 0.11991097 0.12798334
 0.12607604 0.13113526 0.11988023 0.08656709 0.1234619  0.13579099
 0.12644334 0.06038032 0.09718402 0.11945954 0.07203055 0.07312478
 0.04845929 0.11428716 0.0517134  0.05654402 0.10288975 0.09859159
 0.11567913 0.11646192 0.12364919 0.11258015 0.09615954 0.09473786
 0.09442506 0.11719093 0.12541212 0.07581429]
#+end_example

